import grownUpImg from "../assets/grown-up.svg"
import childrenImg from "../assets/children.svg"
import { TypePatient } from "../../pages"


export interface IPatient {
	age: string
	img: { src: string },
	diagnostics: string[],
	type: TypePatient
}

const initialState: { patients: IPatient[] } = {
	patients: [
		{
			age: "Взрослый",
			img: grownUpImg,
			diagnostics: [
				"Менее тяжелые формы СМА могут возникать и диагностироваться в зрелом возрасте.",
				"По сравнению с СМА у детей, СМА у взрослых может иметь более легкие симптомы, но без патогенетической терапии пациенты со СМА 2-3 типа неуклонно теряют двигательные навыки.",
				"По сравнению с СМА в детстве, течение СМА у взрослых может быть более коварным и трудным для распознавания."
			],
			type: 0
		},
		{
			type: 1,
			age: "Ребенок",
			img: childrenImg,
			diagnostics: [
				"Ребенок, плохо удерживающий голову, когда ему придают сидячее положение, с вялыми движениями нижних конечностей или с трудом тянущийся к предметам но при этом с осмысленным и ярким взглядом, улыбающийся и социально активный вызывает настороженность в отношении наличия СМА.",
				"Младенцам со СМА необходимо экстренное направление к специалисту, ранняя диагностика и обеспечение терапией, спасающей жизнь, поскольку эти мотонейроны очень быстро подвергаются дегенерации при прогрессировании заболевания"
			]
		}
	]
}

export type IArticlesData = typeof initialState

export default (): IArticlesData => {
	return initialState
}

